Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
google_compute_instance.test4: Refreshing state... [id=projects/silken-precinct-300608/zones/asia-southeast1-b/instances/finaltest]
google_compute_instance.test1: Refreshing state... [id=projects/silken-precinct-300608/zones/asia-southeast1-b/instances/firsttest1234]
google_storage_bucket.tfstate: Refreshing state... [id=remotestate]
google_compute_instance.test2: Refreshing state... [id=projects/silken-precinct-300608/zones/asia-southeast1-b/instances/instance1]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_compute_instance.test2 will be destroyed
- resource "google_compute_instance" "test2" {
      - can_ip_forward       = false -> null
      - cpu_platform         = "AMD Rome" -> null
      - current_status       = "RUNNING" -> null
      - deletion_protection  = false -> null
      - enable_display       = false -> null
      - guest_accelerator    = [] -> null
      - id                   = "projects/silken-precinct-300608/zones/asia-southeast1-b/instances/instance1" -> null
      - instance_id          = "7647976982584655125" -> null
      - label_fingerprint    = "42WmSpB8rSM=" -> null
      - labels               = {} -> null
      - machine_type         = "e2-micro" -> null
      - metadata             = {} -> null
      - metadata_fingerprint = "iYTj4eG0k_Q=" -> null
      - name                 = "instance1" -> null
      - project              = "silken-precinct-300608" -> null
      - resource_policies    = [] -> null
      - self_link            = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/zones/asia-southeast1-b/instances/instance1" -> null
      - tags                 = [] -> null
      - tags_fingerprint     = "42WmSpB8rSM=" -> null
      - zone                 = "asia-southeast1-b" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "persistent-disk-0" -> null
          - mode        = "READ_WRITE" -> null
          - source      = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/zones/asia-southeast1-b/disks/instance1" -> null

          - initialize_params {
              - image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20201216" -> null
              - labels = {} -> null
              - size   = 10 -> null
              - type   = "pd-standard" -> null
            }
        }

      - network_interface {
          - name               = "nic0" -> null
          - network            = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/global/networks/default" -> null
          - network_ip         = "10.148.0.25" -> null
          - subnetwork         = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/regions/asia-southeast1/subnetworks/default" -> null
          - subnetwork_project = "silken-precinct-300608" -> null
        }

      - scheduling {
          - automatic_restart   = true -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
        }
    }

  # google_compute_instance.test3 will be created
+ resource "google_compute_instance" "test3" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "finaltest"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.test4 will be destroyed
- resource "google_compute_instance" "test4" {
      - can_ip_forward       = false -> null
      - cpu_platform         = "AMD Rome" -> null
      - current_status       = "RUNNING" -> null
      - deletion_protection  = false -> null
      - enable_display       = false -> null
      - guest_accelerator    = [] -> null
      - id                   = "projects/silken-precinct-300608/zones/asia-southeast1-b/instances/finaltest" -> null
      - instance_id          = "2366369017663457405" -> null
      - label_fingerprint    = "42WmSpB8rSM=" -> null
      - labels               = {} -> null
      - machine_type         = "e2-micro" -> null
      - metadata             = {} -> null
      - metadata_fingerprint = "iYTj4eG0k_Q=" -> null
      - name                 = "finaltest" -> null
      - project              = "silken-precinct-300608" -> null
      - resource_policies    = [] -> null
      - self_link            = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/zones/asia-southeast1-b/instances/finaltest" -> null
      - tags                 = [] -> null
      - tags_fingerprint     = "42WmSpB8rSM=" -> null
      - zone                 = "asia-southeast1-b" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "persistent-disk-0" -> null
          - mode        = "READ_WRITE" -> null
          - source      = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/zones/asia-southeast1-b/disks/finaltest" -> null

          - initialize_params {
              - image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20201216" -> null
              - labels = {} -> null
              - size   = 10 -> null
              - type   = "pd-standard" -> null
            }
        }

      - network_interface {
          - name               = "nic0" -> null
          - network            = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/global/networks/default" -> null
          - network_ip         = "10.148.0.24" -> null
          - subnetwork         = "https://www.googleapis.com/compute/v1/projects/silken-precinct-300608/regions/asia-southeast1/subnetworks/default" -> null
          - subnetwork_project = "silken-precinct-300608" -> null
        }

      - scheduling {
          - automatic_restart   = true -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://206.189.47.123/lock?id=WJay-tec%252Ftestatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
